examples/dfHighSpeedFoam/oneD_shockWaterMist/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs (
      "libEvaporationNew.so"
     );

application     dfHighSpeedFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.4e-03;

deltaT          2e-07;

writeControl    adjustableRunTime;

writeInterval   1e-05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  no;

maxCo           0.1;

runTimeModifiable yes;

// ************************************************************************* //
