examples/dfHighSpeedFoam/oneD_shockWaterMist/constant/sprayCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      SprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            h               explicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
        DUcDt           cellPoint;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
        // T               Euler;
    }
}


constantProperties
{
    T0              275.0;

    // place holders for rho0 and Cp0
    // - reset from liquid properties using T0
    rho0            1000.9;
    Cp0             4222.4;

    constantVolume  false;
}


subModels
{
    particleForces
    {
        SchillerNaumannDrag;
        pressureGradient;
    }

    injectionModels
    {
        model1
        {
            type              manualInjection;
            massTotal         4.14785e-7;//1.244355e-06; // total mass
            positionsFile     "cloudPositions"; 
            parcelBasisType   fixed;
            nParticle         2.2e+5;
            duration          0;
            SOI               0; 
            U0                (0.0 0.0 0.0);
            sizeDistribution
            {
                type uniform;
                uniformDistribution
                {
                    minValue        2.4e-06; 
                    maxValue        2.4e-06;
                }
            }
        }
    }

    dispersionModel none;

    patchInteractionModel none;

    heatTransferModel RanzMarshall;

    compositionModel singlePhaseMixture;

    phaseChangeModel liquidEvaporationBoil;

    surfaceFilmModel none;

    atomizationModel none;

    breakupModel    none;

    stochasticCollisionModel none;

    radiation       off;

    RanzMarshallCoeffs
    {
        BirdCorrection  off;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                H2O               1;
            }
        );
    }

    liquidEvaporationBoilCoeffs
    {
        enthalpyTransfer latentHeat;

        activeLiquids    ( H2O );
    }
}


cloudFunctions
{}


// ************************************************************************* //
