examples/dfHighSpeedFoam/oneD_shockWaterMist/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue T 275
    volScalarFieldValue p 66000 //0.66 bar
);

regions
(
    boxToCell
    {
        box (-0.1 0 0) (0.0 0.01 0.01);
        fieldValues
        (
            volVectorFieldValue U (125.076 0 0)
            volScalarFieldValue T 318
            volScalarFieldValue p 109312.5 //1.093125 bar
        );
    }
);


// ************************************************************************* //
